#include <stdio.h>
#include <stdlib.h>
//#define MAX_SIZE 100

//void bubble(int m[], int);

	
	//-------------------------------------------------------------------------2
	// Функция алгоритма сортировки массива методом "пузырька"
	
void bubble(int m[100], int n)
{
	for (int i=n-1; i>=0; i--)
	{
		for (int j=0; j<i; j++)
	    {
			if (m[j] > m[j+1])
			{
				int tmp = m[j];
				m[j] = m[j+1];
				m[j+1] = tmp;
    		}
		}
	}
}

int main()
{
	int m[100];
	int i;																		
	int n;
	int tmp;				// временная переменная для обмена элементов местами
	
	//-------------------------------------------------------------------------1
	// Ввод данных массива
	
	printf("n? ");
	scanf("%d",&n);
	for(i=0;i<n;i++)
	{
		printf("m[%d]? ",i);
		scanf("%d",&m[i]);
	}

	//-------------------------------------------------------------------------3
	// Вывод отсортированного массива
	
	for(i=0;i<n;i++)
	{
		printf("%d->", m[i]);
	}
	
	return 0;
}